{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "RecurrentContainer", "config": {"decode": false, "trainable": true, "name": "recurrentcontainer_1", "state_sync": false, "go_backwards": false, "output_length": null, "unroll": false, "readout": false, "stateful": false, "return_states": false, "input_dtype": "float32", "return_sequences": false, "batch_input_shape": [null, null, 41], "model": [{"class_name": "LSTMCell", "config": {"U_regularizer": null, "name": "lstmcell_1", "inner_activation": "hard_sigmoid", "output_dim": 128, "trainable": true, "init": "glorot_uniform", "inner_init": "orthogonal", "input_dtype": "float32", "batch_input_shape": [null, 41], "W_regularizer": null, "activation": "tanh", "forget_bias_init": "one", "b_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.0, "trainable": true, "name": "dropout_1"}}, {"class_name": "LSTMCell", "config": {"U_regularizer": null, "name": "lstmcell_2", "inner_activation": "hard_sigmoid", "output_dim": 128, "trainable": true, "init": "glorot_uniform", "inner_init": "orthogonal", "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "forget_bias_init": "one"}}, {"class_name": "Dropout", "config": {"p": 0.0, "trainable": true, "name": "dropout_2"}}, {"class_name": "LSTMCell", "config": {"U_regularizer": null, "name": "lstmcell_3", "inner_activation": "hard_sigmoid", "output_dim": 128, "trainable": true, "init": "glorot_uniform", "inner_init": "orthogonal", "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "forget_bias_init": "one"}}, {"class_name": "Dropout", "config": {"p": 0.0, "trainable": true, "name": "dropout_3"}}, {"class_name": "LSTMCell", "config": {"U_regularizer": null, "name": "lstmcell_4", "inner_activation": "hard_sigmoid", "output_dim": 128, "trainable": true, "init": "glorot_uniform", "inner_init": "orthogonal", "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "forget_bias_init": "one"}}], "input_length": null}}, {"class_name": "RecurrentContainer", "config": {"decode": true, "trainable": true, "name": "recurrentcontainer_2", "state_sync": false, "go_backwards": false, "output_length": 45, "unroll": false, "readout": false, "stateful": false, "return_states": false, "return_sequences": true, "batch_input_shape": [null, 128], "model": [{"class_name": "Dropout", "config": {"p": 0.0, "batch_input_shape": [null, 128], "trainable": true, "name": "dropout_4", "input_dtype": "float32"}}, {"class_name": "LSTMCell", "config": {"U_regularizer": null, "name": "lstmcell_5", "inner_activation": "hard_sigmoid", "output_dim": 128, "trainable": true, "init": "glorot_uniform", "inner_init": "orthogonal", "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "forget_bias_init": "one"}}, {"class_name": "Dropout", "config": {"p": 0.0, "trainable": true, "name": "dropout_5"}}, {"class_name": "LSTMCell", "config": {"U_regularizer": null, "name": "lstmcell_6", "inner_activation": "hard_sigmoid", "output_dim": 128, "trainable": true, "init": "glorot_uniform", "inner_init": "orthogonal", "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "forget_bias_init": "one"}}, {"class_name": "Dropout", "config": {"p": 0.0, "trainable": true, "name": "dropout_6"}}, {"class_name": "LSTMCell", "config": {"U_regularizer": null, "name": "lstmcell_7", "inner_activation": "hard_sigmoid", "output_dim": 46, "trainable": true, "init": "glorot_uniform", "inner_init": "orthogonal", "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "forget_bias_init": "one"}}], "input_length": null}}]}